app/controllers/application_controller.rb

    def ensure_moderator
        # debugger
        @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]