app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "abc"], ["description", "abcccc"], ["user_id", 1]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.user_id = current_user.id
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1 WHERE "subs"."id" = $2  [["description", "changed"], ["id", 1]]
---
    def update
        @sub = Sub.find(params[:id])
        if @sub.update(sub_params)