app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "session_token", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["username", "hi"], ["session_token", "xjgsFVkPDM9rg5-DQIsjEA"], ["password_digest", "$2a$12$sB67GrKpsuxX/rC1R9dM1ODP0lmgyClgFf.ErejzkGo2NRUGchMkK"]]