app/models/user.rb

    def self.find_by_credentials(username, password)
        @user = User.find(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ihatebugs"], ["LIMIT", 1]]

    def reset_session_token
        self.session_token = User.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "WAJnUb6nE_qFvQSdB__TyA"], ["id", 1]]